export function getTechMaps() {
  return [
    {
      id: "TMP-XXX-YYY-ZZZ-YY0",
      name: "Хліб Французький (КХ)",
      units: [1, 6, 8, 10, 12, 14, 16, 18, 20],
      steps: [
        {
          name: "Замішування",
          ingredients: [
            { 
              id: "ING-XXX-YYY-ZZZ-YY0",
              countByUnits: {
                "1": 292,
                "6": 1752,
                "8": 2336,
                "10": 2920,
                "12": 3504,
                "14": 4088,
                "16": 4672,
                "18": 5256,
                "20": 5840,
              }
            },
            { 
              id: "ING-XXX-YYY-ZZZ-YY1",
              countByUnits: {
                "1": 163,
                "6": 978,
                "8": 1304,
                "10": 1630,
                "12": 1956,
                "14": 2282,
                "16": 2608,
                "18": 2934,
                "20": 3260,
              }
            },
            { 
              id: "ING-XXX-YYY-ZZZ-YY2",
              countByUnits: {
                "1": 78,
                "6": 468,
                "8": 624,
                "10": 780,
                "12": 936,
                "14": 1092,
                "16": 1248,
                "18": 1404,
                "20": 1560,
              }
            }
          ],
          humanResources: [
            {
              count: 1,
              timeNormsByUnit: {
                "1": 15,
                "6": 22,
                "8": 25,
                "10": 26,
                "12": 28,
                "14": 30,
                "16": 32,
                "18": 34,
                "20": 36,                    
              }
            },
            {
              count: 2,
              timeNormsByUnit: {
                "1": 10,
                "6": 15,
                "8": 16,
                "10": 17,
                "12": 18,
                "14": 19,
                "16": 20,
                "18": 21,
                "20": 22,                    
              }
            }
          ],
          inventory: [
            {
              id: "INV-XXX-YYY-ZZZ,YY0",
              countByUnits: {
                "1": 1,
                "6": 1,
                "8": 1,
                "10": 1,
                "12": 1,
                "14": 1,
                "16": 2,
                "18": 2,
                "20": 2,                                    
              }
            }
          ],
          instructions: `
            1. Відважити воду та пшеничну закваску в чисту і суху ємність відповідного об'єму.
            2. Окремо відважити боршно в чисту і суху ємність відповідного об’єму.
            3. В спіральному тістомісі змішати компоненти з послідовності (1) на протязі 4—5 хвилин (в залежності від кількості замісу).
            `
        },
        {
          name: "Замішування",
          ingredients: [
            { 
              id: "ING-XXX-YYY-ZZZ-YY0",
              countByUnits: {
                "1": 292,
                "6": 1752,
                "8": 2336,
                "10": 2920,
                "12": 3504,
                "14": 4088,
                "16": 4672,
                "18": 5256,
                "20": 5840,
              }
            },
            { 
              id: "ING-XXX-YYY-ZZZ-YY1",
              countByUnits: {
                "1": 163,
                "6": 978,
                "8": 1304,
                "10": 1630,
                "12": 1956,
                "14": 2282,
                "16": 2608,
                "18": 2934,
                "20": 3260,
              }
            },
            { 
              id: "ING-XXX-YYY-ZZZ-YY2",
              countByUnits: {
                "1": 78,
                "6": 468,
                "8": 624,
                "10": 780,
                "12": 936,
                "14": 1092,
                "16": 1248,
                "18": 1404,
                "20": 1560,
              }
            }
          ],
          humanResources: [
            {
              count: 1,
              timeNormsByUnit: {
                "1": 15,
                "6": 22,
                "8": 25,
                "10": 26,
                "12": 28,
                "14": 30,
                "16": 32,
                "18": 34,
                "20": 36,                    
              }
            },
            {
              count: 2,
              timeNormsByUnit: {
                "1": 10,
                "6": 15,
                "8": 16,
                "10": 17,
                "12": 18,
                "14": 19,
                "16": 20,
                "18": 21,
                "20": 22,                    
              }
            }
          ],
          inventory: [
            {
              id: "INV-XXX-YYY-ZZZ,YY0",
              countByUnits: {
                "1": 1,
                "6": 1,
                "8": 1,
                "10": 1,
                "12": 1,
                "14": 1,
                "16": 2,
                "18": 2,
                "20": 2,                                    
              }
            }
          ],
          instructions: `
            1. Відважити воду та пшеничну закваску в чисту і суху ємність відповідного об'єму.
            2. Окремо відважити боршно в чисту і суху ємність відповідного об’єму.
            3. В спіральному тістомісі змішати компоненти з послідовності (1) на протязі 4—5 хвилин (в залежності від кількості замісу).
            `
        }
      ]
    }
  ]
}

export function getIngredients() {
  return [
    {
      id: "ING-XXX-YYY-ZZZ-YY0",
      name: "Борошно пшеничне 1 гат",
      units: "г"
    },
    {
      id: "ING-XXX-YYY-ZZZ-YY1",
      name: "Вода",
      units: "мл"
    },
    {
      id: "ING-XXX-YYY-ZZZ-YY2",
      name: "Закваска пшенична",
      units: "г"
    }
  ]
}

export function getInventory() {
  return [
    {
      id: "INV-XXX-YYY-ZZZ,YY0",
      name: "Спіральний тістоміс",
      units: "шт"
    }
  ]
}